Repository: imgul/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Creational/FactoryMethod/README.po
Languages: uk

source: `Factory Method`__
uk: `Фабричний метод <https://uk.wikipedia.org/wiki/Фабричний_метод_(шаблон_проєктування)>`_ (`Factory Method`__)

source: Purpose
uk: Призначення

source: The good point over the SimpleFactory is you can subclass it to implement different ways to create objects.
uk: Вигідна відмінність від SimpleFactory в тому, що ви можете винести реалізацію створення об'єктів у підкласи.

source: For simple cases, this abstract class could be just an interface.
uk: У простих випадках цей абстрактний клас може бути тільки інтерфейсом.

source: This pattern is a "real" Design Pattern because it achieves the Dependency Inversion principle a.k.a the "D" in SOLID principles.
uk: Цей патерн є "справжнім" Шаблоном Проектування, тому що він слід "Принципу інверсії залежностей" також відомому як "D" в `S.O.L.I.D <https://uk.wikipedia.org/wiki/SOLID_(об'єктно-орієнтоване_програмування)>`_.

source: It means the FactoryMethod class depends on abstractions, not concrete classes. This is the real trick compared to SimpleFactory or StaticFactory.
uk: Це означає, що клас FactoryMethod залежить від абстракцій, а не від конкретних класів. Це істотний плюс у порівнянні з SimpleFactory або StaticFactory.

source: UML Diagram
uk: Діаграма UML

source: Code
uk: Код

source: You can also find this code on `GitHub`_
uk: Ви можете знайти цей код на `GitHub`_

source: Test
uk: Тест
