Repository: imgul/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Behavioral/NullObject/README.po
Languages: uk

source: `Null Object`__
uk: `Null object <https://uk.wikipedia.org/wiki/Null_object_(шаблон_проєктування)>`_ (`Null Object`__)

source: Purpose
uk: Призначення

source: NullObject is not a GoF design pattern but a schema which appears frequently enough to be considered a pattern. It has the following benefits:
uk: NullObject не шаблон з книги Банди Чотирьох, але схема, яка з'являється досить часто, щоб вважатися патерном. Вона має такіпереваги:

source: Client code is simplified
uk: Клієнтський код спрощується

source: Reduces the chance of null pointer exceptions
uk: Зменшує шанс виключень через нульові покажчики (і помилок PHP різного рівня)

source: Fewer conditionals require less test cases
uk: Менше додаткових умов - значить менше тест кейсів

source: Methods that return an object or null should instead return an object or ``NullObject``. ``NullObject``\ s simplify boilerplate code such as ``if (!is_null($obj)) { $obj->callSomething(); }`` to just ``$obj->callSomething();`` by eliminating the conditional check in client code.
uk: Методи, які повертають об'єкт або Null, натомість повинні повернути об'єкт ``NullObject``. ``NullObject``\ це спрощений формальний код, що усуває необхідність перевірки ``if (!is_null($obj)) { $obj->callSomething(); }``, замінюючи її на звичайний виклик ``$obj->callSomething();``.

source: Examples
uk: Приклади

source: Null logger or null output to preserve a standard way of interaction between objects, even if the shouldn't do anything
uk: Null logger або null output для збереження стандартного способу взаємодії між об'єктами, навіть якщо вони не повинні нічого робити

source: null handler in a Chain of Responsibilities pattern
uk: null handler у патерні Ланцюжка обов'язків

source: null command in a Command pattern
uk: null command у патерні Команда

source: UML Diagram
uk: Діаграма UML

source: Code
uk: Код

source: You can also find this code on `GitHub`_
uk: Ви можете знайти цей код на `GitHub`_

source: Test
uk: Тест
