Repository: imgul/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Structural/Facade/README.po
Languages: uk

source: `Facade`__
uk: `Фасад <https://uk.wikipedia.org/wiki/Фасад_(шаблон_проєктування)>`_ (`Facade`__)

source: Purpose
uk: Призначення

source: The primary goal of a Facade Pattern is not to avoid you having to read themanual of a complex API. It's only a side-effect. The first goal is toreduce coupling and follow the Law of Demeter.
uk: Основна мета патерну Фасад полягає не в тому, щоб завадити вам прочитати інструкцію комплексного API. Це тільки побічний ефект. Головнамета все ж таки полягає у зменшенні зв'язності коду та дотриманні `Закону Деметри <https://uk.wikipedia.org/wiki/Закон_Деметри>`_.

source: A Facade is meant to decouple a client and a sub-system by embedding many (but sometimes just one) interface, and of course to reduce complexity.
uk: Фасад призначений для поділу клієнта та підсистеми шляхом впровадження багатьох (але іноді тільки одного) інтерфейсів, і, звичайно, зменшення загальної складності.

source: A facade does not forbid you the access to the sub-system
uk: Фасад не забороняє прямий доступ до підсистеми. Просто він робить його простіше і зрозуміліше.

source: You can (you should) have multiple facades for one sub-system
uk: Ви можете (і вам варто) мати кілька фасадів для однієї підсистеми.

source: That's why a good facade has no ``new`` in it. If there are multiple creations for each method, it is not a Facade, it's a Builder or a [Abstract\|Static\|Simple] Factory [Method].
uk: Ось чому хороший фасад не містить створення екземплярів класів (``new``) всередині. Якщо всередині фасаду створюються об'єкти для реалізації кожного методу, це не Фасад, це Будівельник або [Абстрактна|Статична\|Проста] Фабрика [або Фабричний Метод].

source: The best facade has no ``new`` and a constructor with interface-type-hinted parameters. If you need creation of new instances, use a Factory as argument.
uk: Кращий фасад не містить ``new`` або конструктора з type-hinted параметрами. Якщо вам необхідно створювати нові екземпляри класів, в такому випадку краще використовувати Фабрику як аргумент.

source: UML Diagram
uk: Діаграма UML

source: Code
uk: Код

source: You can also find this code on `GitHub`_
uk: Ви можете знайти цей код на `GitHub`_

source: Test
uk: Тест
