Repository: imgul/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Behavioral/TemplateMethod/README.po
Languages: uk

source: `Template Method`__
uk: `Шаблонний Метод <https://uk.wikipedia.org/wiki/Шаблонний_метод_(шаблон_проєктування)>`_ (`Template Method`__)

source: Purpose
uk: Призначення

source: Template Method is a behavioral design pattern.
uk: Шаблонний метод, це поведінковий патерн проектування.

source: Perhaps you have encountered it many times already. The idea is to let subclasses of this abstract template "finish" the behavior of an algorithm.
uk: Можливо, ви стикалися з цим вже багато разів. Ідея полягає в тому, щоб дозволити спадкоємцям абстрактного класу перевизначити поведінку алгоритмів батьківського класу.

source: A.k.a the "Hollywood principle": "Don't call us, we call you." This class is not called by subclasses but the inverse. How? With abstraction of course.
uk: Як у «Голлівудському принципі»: «Не дзвоніть нам, ми самі вам подзвонимо». клас не викликається підкласами, але навпаки: підкласи викликаються батьком. Як? За допомогою методу в батьківській абстракції, звичайно.

source: In other words, this is a skeleton of algorithm, well-suited for framework libraries. The user has just to implement one method and the superclass do the job.
uk: Іншими словами, це каркас алгоритму, який добре підходить для бібліотек (у фреймворках, наприклад). Користувач просто реалізує уточнюючі методи, а суперклас робить всю основну роботу.

source: It is an easy way to decouple concrete classes and reduce copy-paste, that's why you'll find it everywhere.
uk: Це простий спосіб ізолювати логіку у конкретні класи та зменшити копіпаст, тому ви повсюдно зустрінете його у тому чи іншому вигляді.

source: UML Diagram
uk: Діаграма UML

source: Code
uk: Код

source: You can also find this code on `GitHub`_
uk: Ви можете знайти цей код на `GitHub`_

source: Test
uk: Тест
