Repository: imgul/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Behavioral/Command/README.po
Languages: uk

source: `Command`__
uk: `Команда <https://uk.wikipedia.org/wiki/Команда_(шаблон_проєктування)>`_ (`Command`__)

source: Purpose
uk: Призначення

source: To encapsulate invocation and decoupling.
uk: Інкапсулювати дію та її параметри

source: We have an Invoker and a Receiver. This pattern uses a "Command" to delegate the method call against the Receiver and presents the same method "execute". Therefore, the Invoker just knows to call "execute" to process the Command of the client. The Receiver is decoupled from the Invoker.
uk: Припустимо, у нас є об'єкти Invoker (Командир) та Receiver (Виконавець). Цей патерн використовує реалізацію інтерфейсу "Команда", щоб викликати якийсь метод Виконавця використовуючи для цього відомий Командирові метод execute()». Командир просто знає, що потрібно викликати метод “execute()”, для обробки команди клієнта, не розбираючись у деталях реалізації Виконавця. Виконавець відокремлений від Командира.

source: The second aspect of this pattern is the undo(), which undoes the method execute(). Command can also be aggregated to combine more complex commands with minimum copy-paste and relying on composition over inheritance.
uk: Другим аспектом цього патерну є метод undo(), який скасовує дію, що виконується методом execute(). Команди також можуть бути об'єднані в більш загальні команди з мінімальним копіюванням-вставкою та покладаючись на композицію поверх успадкування.

source: Examples
uk: Приклади

source: A text editor : all events are commands which can be undone, stacked and saved.
uk: Текстовий редактор: всі події є командами, які можуть бути відмінено, вибудовано в певну послідовність і збережено.

source: big CLI tools use subcommands to distribute various tasks and pack them in "modules", each of these can be implemented with the Command pattern (e.g. vagrant)
uk: великі утиліти для командного рядка (наприклад, Vagrant) використовують вкладені команди для поділу різних завдань та упаковки їх у «модулі», кожен з яких може бути реалізований за допомогою патерну "Команда".

source: UML Diagram
uk: Діаграма UML

source: Code
uk: Код

source: You can also find this code on `GitHub`_
uk: Ви можете знайти цей код на `GitHub`_

source: Test
uk: Тест
