Repository: imgul/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Creational/SimpleFactory/README.po
Languages: uk

source: Simple Factory
uk: Проста Фабрика (Simple Factory)

source: Purpose
uk: Призначення

source: SimpleFactory is a simple factory pattern.
uk: SimpleFactory у прикладі нижче, це патерн "Проста Фабрика".

source: It differs from the static factory because it is not static. Therefore, you can have multiple factories, differently parameterized, you can subclass it and you can mock it. It always should be preferred over a static factory!
uk: Вона відрізняється від Статичної Фабрики тим, що власне *не є статичної*. Таким чином, ви можете мати безліч фабрик з різними параметрами. Проста фабрика завжди повинна бути кращою за Статичну фабрику!

source: Therefore, you can have multiple factories, differently parametrized, you can subclass it and you can mock it.
uk: Тому ви можете мати кілька фабрик, параметризованих різним Образом. Ви можете успадкувати їх і створювати макети для тестування.

source: It always should be preferred over a static factory!
uk: Проста фабрика завжди повинна бути краще статичної фабрики

source: UML Diagram
uk: Діаграма UML

source: Code
uk: Код

source: You can also find this code on `GitHub`_
uk: Ви можете знайти цей код на `GitHub`_

source: Test
uk: Тест
